<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Examplify and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.JMA-Recipes.munki.Examplify</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Examplify</string>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
			<string>RequireRestart</string>
			<key>blocking_applications</key>
			<array>
				<string>Examplify.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> Examplify from ExamSoft provides the secure, offline testing platform your educational program needs to keep the exam environment secure and stable.</string>
			<key>developer</key>
				<string>ExamSoft</string>
			<key>display_name</key>
			<string>Examplify</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>preuninstall_script</key>
			<string>#!/bin/sh
			launchctl unload /Library/LaunchDaemons/com.examsoft.ExamplifyService.plist
                        exit 0</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.JMA-Recipes.download.Examplify</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
