<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of PollEverywhere for Mac.</string>
		<key>Identifier</key>
		<string>com.github.JMA-Recipes.download.Pollev</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Poll Everywhere</string>
			<key>DOWNLOAD_URL</key>
			<string>https://s3.amazonaws.com/polleverywhere-app/mac-stable/pollev.dmg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.9</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
